public class GitHub {

    /*
    Система контроля версий
    - хранит код и его историю
    - совместная разработка

    SVN - устаревает
    Git - распределенная система
    Mercurial - распределенная система

    Git популярнее Mercurial, хотя Mercurial проще при тех же возможностях.
    Git - автор Линус Горвадс, автор Linux. В гите хранится линукс.
    Mercurial - хранит Java.

    Сайт github.com (принадлежит Microsoft).

    Использование:
    1) командная строка
    2) через IDEA
    3) Самый популярный графический клиент - TurtleGit

    Репозиторий

    Папка ver 3
        ^
        |           - создание папки с историей.
    Папка ver 2
        ^
        |           - изменения: добавление/удаление файла/содержимого файла.
    Папка ver 1


    github      -->      myPC1
               clone
    github      <--      myPC1
               push
    github      -->      myPC2
               pull
           clone - запустить себе репозиторий с другого устройства
           Изменения:
                add - добавить файл
                remove - удалить файл
           commit - создание новых версий
           push - протолкнуть свою ревизию (новую версию) в другой репозиторий
           pull - забрать ревизии из другого репозитория

    Branch - указатель на ревизию.
    Названия для удаленных репозиториев.
    Обычно github будет называться origin.
    master - ваша ветка.
    originmaster - ветка master, но на компьютере origin.
    Операция merge - объединение нескольких ревизий.

     */
}
